Tekla.Structures.Drawing.PropertyElement.PropertyElementType.MergedMarkPropertyElementTypes
The MergedMarkPropertyElementTypes class represents the available property element types for merged marks.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.MergedMarkPropertyElementTypes.BlockPrefix
Returns the block prefix property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.MergedMarkPropertyElementTypes.SingleMarkContent
Returns the single mark content property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.MergedMarkPropertyElementTypes.DistancesBetweenGroups
Returns the distances between groups property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.MergedMarkPropertyElementTypes.SymbolSeparatingBlocksInMarks
Returns the symbol separating blocks in marks property element type.
Returns: The requested property element type.